var a = {n: 1}
var b = a
a.x = a = {n: 2}

console.log(a.n, b.n);
console.log(a.x, b.x);

// var b = a,此时a和b指向同一个对象。

// .运算符比 = 运算符高,先计算`a.x`,此时 
// b = {
//     n:1,
//     x:undefined
// }

// 相当于给对象添加了x属性。

// a.x = a = {n:2};

// 计算完a.x,再计算 = ,赋值是从右向左,此时a指向一个新对象。
// a = {
//     n:2
// }

// a.x已经执行过了,此时对象的x属性赋值为a,此时

// 对象 = {
//     n:1,
//     x:{
//         n:2
//     }
// }

// 即:
// a = {
//     n:2
// }

// b = {
//     n:1,
//     x:{
//         n:2
//     }
// }

